# parameters
nc: 16  # number of classes
depth_multiple: 0.5  # model depth multiple
width_multiple: 0.5  # layer channel multiple

anchors:
  # [16, 32, 64, 128, 256] [2, 5] [0, 45, 90, 135]
  - [ 16, 22, 16, 16, 16, 11, 16, 11, 16, 16, 16, 22, 21, 35, 21, 21, 21, 7, 21, 7, 21, 21, 21, 35]  # P2/4
  - [ 33, 45, 33, 33, 33, 22, 33, 22, 33, 33, 33, 45, 42, 71, 42, 42, 42, 14, 42, 14, 42, 42, 42, 71]  # P3/8
  - [ 66, 90, 66, 66, 66, 44, 66, 44, 66, 66, 66, 90, 84, 142, 84, 84, 84, 28, 84, 28, 84, 84, 84, 142 ]  # P4/16
  - [ 132, 180, 132, 132, 132, 88, 132, 88, 132, 132, 132, 180, 168, 284, 168, 168, 168, 56, 168, 56, 168, 168, 168, 284 ]  # P5/32
  - [ 264, 360, 264, 264, 264, 176, 264, 176, 264, 264, 264, 360, 336, 568, 336, 336, 336, 112, 336, 112, 336, 336, 336, 568 ]  # P6/64

backbone:
  # [from, number, module, args]
  [[-1, 1, ReOrg, []],  # 0
   [-1, 1, Conv, [64, 3, 1]],  # 1-P1/2
   
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4
   [ -1, 1, RotaConv, [ 128, 3, 1 ] ],  # Angle Convolution P2

   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -4,], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 9

   [-1, 1, Conv, [256, 3, 2]],  # 10-P3/8
   [ -1, 1, RotaConv, [ 256, 3, 1 ] ],  # Angle Convolution P3

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -4,], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 17
         
   [-1, 1, Conv, [512, 3, 2]],  # 18-P4/16
   [ -1, 1, RotaConv, [ 512, 3, 1 ] ],  # Angle Convolution P4

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -4,], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 25
         
   [-1, 1, Conv, [768, 3, 2]],  # 26-P5/32
   [ -1, 1, RotaConv, [ 768, 3, 1 ] ],  # Angle Convolution P5

   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   [-1, 1, Conv, [384, 3, 1]],
   [[-1, -3, -4,], 1, Concat, [1]],
   [-1, 1, Conv, [768, 1, 1]],  # 33
         
   [-1, 1, Conv, [1024, 3, 2]],  # 34-P6/64
   [ -1, 1, RotaConv, [ 1024, 3, 1 ] ],  # Angle Convolution P6

   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [[-1, -3, -4,], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 41
  ]

head:
  [[-1, 1, SPPCSPC, [512]], # 37

   [-1, 1, Conv, [384, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [33, 1, Conv, [384, 1, 1]], # 29 route backbone P5
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [[-1, -2, -3, -4,], 1, Concat, [1]],
   [-1, 1, Conv, [384, 1, 1]], # 47

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [25, 1, Conv, [256, 1, 1]], #22 route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 57

   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [17, 1, Conv, [192, 1, 1]], # 15 route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [192, 1, 1]],
   [-2, 1, Conv, [192, 1, 1]],
   [-1, 1, Conv, [96, 3, 1]],
   [-1, 1, Conv, [96, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [192, 1, 1]], # 67

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ 9, 1, Conv, [ 128, 1, 1 ] ], # 8 route backbone P2
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -2, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1 ] ], # 77

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 72], 1, Concat, [1]],  # 67 cat

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 85

   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 62], 1, Concat, [1]],  # 57 cat

   [-1, 1, Conv, [384, 1, 1]],
   [-2, 1, Conv, [384, 1, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, Conv, [192, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [384, 1, 1]], # 93

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 52], 1, Concat, [1]],  # 47 cat

   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 101

   [ -1, 1, Conv, [ 768, 3, 2 ] ],
   [ [ -1, 42], 1, Concat, [ 1 ] ],  # 37 cat

   [ -1, 1, Conv, [ 768, 1, 1 ] ],
   [ -2, 1, Conv, [ 768, 1, 1 ] ],
   [ -1, 1, Conv, [ 384, 3, 1 ] ],
   [ -1, 1, Conv, [ 384, 3, 1 ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 768, 1, 1 ] ], # 109

    [82, 1, Conv, [256, 3, 1]], # 77 110
    [90, 1, Conv, [384, 3, 1]],  # 85
    [98, 1, Conv, [512, 3, 1]],  # 93
    [106, 1, Conv, [768, 3, 1]],  # 101
    [114, 1, Conv, [1024, 3, 1]],  # 109 114

   [[115, 116, 117, 118, 119], 1, Detect, [nc, anchors]],   # 110, 111, 112, 113, 114  Detect(P2, P3, P4, P5, P6)
  ]